memfault/zero-to-main/xdk-asf-3.32.0/sam0/utils/cmsis/samb11/include/pio/btlc1000wlcsp.h
/**
 * \file
 *
 * \brief Peripheral I/O description for BTLC1000WLCSP
 *
 * Copyright (c) 2016 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _BTLC1000WLCSP_PIO_
#define _BTLC1000WLCSP_PIO_

#define PIN_LP_GPIO_0                     0  /**< Pin Number for LP_GPIO_0 */
#define GPIO_LP_GPIO_0           (1ul <<  0) /**< GPIO Mask for LP_GPIO_0 */
#define PIN_LP_GPIO_1                     1  /**< Pin Number for LP_GPIO_1 */
#define GPIO_LP_GPIO_1           (1ul <<  1) /**< GPIO Mask for LP_GPIO_1 */
#define PIN_LP_GPIO_2                     2  /**< Pin Number for LP_GPIO_2 */
#define GPIO_LP_GPIO_2           (1ul <<  2) /**< GPIO Mask for LP_GPIO_2 */
#define PIN_LP_GPIO_3                     3  /**< Pin Number for LP_GPIO_3 */
#define GPIO_LP_GPIO_3           (1ul <<  3) /**< GPIO Mask for LP_GPIO_3 */
#define PIN_LP_GPIO_8                     8  /**< Pin Number for LP_GPIO_8 */
#define GPIO_LP_GPIO_8           (1ul <<  8) /**< GPIO Mask for LP_GPIO_8 */
#define PIN_LP_GPIO_9                     9  /**< Pin Number for LP_GPIO_9 */
#define GPIO_LP_GPIO_9           (1ul <<  9) /**< GPIO Mask for LP_GPIO_9 */
#define PIN_LP_GPIO_10                   10  /**< Pin Number for LP_GPIO_10 */
#define GPIO_LP_GPIO_10          (1ul << 10) /**< GPIO Mask for LP_GPIO_10 */
#define PIN_LP_GPIO_11                   11  /**< Pin Number for LP_GPIO_11 */
#define GPIO_LP_GPIO_11          (1ul << 11) /**< GPIO Mask for LP_GPIO_11 */
#define PIN_LP_GPIO_12                   12  /**< Pin Number for LP_GPIO_12 */
#define GPIO_LP_GPIO_12          (1ul << 12) /**< GPIO Mask for LP_GPIO_12 */
#define PIN_LP_GPIO_13                   13  /**< Pin Number for LP_GPIO_13 */
#define GPIO_LP_GPIO_13          (1ul << 13) /**< GPIO Mask for LP_GPIO_13 */
#define PIN_AO_GPIO_0                    31  /**< Pin Number for AO_GPIO_0 */
#define GPIO_AO_GPIO_0           (1ul << 15) /**< GPIO Mask for AO_GPIO_0 */
#define PIN_GPIO_MS1                     47  /**< Pin Number for GPIO_MS1 */
#define GPIO_GPIO_MS1            (1ul << 15) /**< GPIO Mask for GPIO_MS1 */

/* PinMux definitions                                               */
/* Mux values for LP_GPIO_0 */
#define MUX_LP_GPIO_0_GPIO                     0x0
#define MUX_LP_GPIO_0_MEGAMUX                  0x1
#define MUX_LP_GPIO_0_SWD_CLK                  0x2
#define MUX_LP_GPIO_0_TEST_OUT_0               0x7
/* Mux values for LP_GPIO_1 */
#define MUX_LP_GPIO_1_GPIO                     0x0
#define MUX_LP_GPIO_1_SWD_IO                   0x2
#define MUX_LP_GPIO_1_MEGAMUX                  0x1
#define MUX_LP_GPIO_1_TEST_OUT_1               0x7
/* Mux values for LP_GPIO_2 */
#define MUX_LP_GPIO_2_MEGAMUX                  0x1
#define MUX_LP_GPIO_2_SPI_FLASH0_SCK           0x6
#define MUX_LP_GPIO_2_TEST_OUT_2               0x7
#define MUX_LP_GPIO_2_UART0_RXD                0x2
#define MUX_LP_GPIO_2_GPIO                     0x0
#define MUX_LP_GPIO_2_SPI0_SCK                 0x5
/* Mux values for LP_GPIO_3 */
#define MUX_LP_GPIO_3_UART0_TXD                0x2
#define MUX_LP_GPIO_3_SPI0_MOSI                0x5
#define MUX_LP_GPIO_3_MEGAMUX                  0x1
#define MUX_LP_GPIO_3_SPI_FLASH0_TXD           0x6
#define MUX_LP_GPIO_3_TEST_OUT_3               0x7
#define MUX_LP_GPIO_3_GPIO                     0x0
/* Mux values for LP_GPIO_8 */
#define MUX_LP_GPIO_8_MEGAMUX                  0x1
#define MUX_LP_GPIO_8_SPI0_SSN                 0x5
#define MUX_LP_GPIO_8_SPI_FLASH0_SSN           0x6
#define MUX_LP_GPIO_8_GPIO                     0x0
#define MUX_LP_GPIO_8_I2C0_SDA                 0x2
#define MUX_LP_GPIO_8_TEST_OUT_8               0x7
/* Mux values for LP_GPIO_9 */
#define MUX_LP_GPIO_9_SPI_FLASH0_RXD           0x6
#define MUX_LP_GPIO_9_MEGAMUX                  0x1
#define MUX_LP_GPIO_9_SPI0_MISO                0x5
#define MUX_LP_GPIO_9_I2C0_SCL                 0x2
#define MUX_LP_GPIO_9_GPIO                     0x0
#define MUX_LP_GPIO_9_TEST_OUT_9               0x7
/* Mux values for LP_GPIO_10 */
#define MUX_LP_GPIO_10_GPIO                    0x0
#define MUX_LP_GPIO_10_MEGAMUX                 0x1
#define MUX_LP_GPIO_10_TEST_OUT_10             0x7
#define MUX_LP_GPIO_10_SPI_FLASH0_SCK          0x6
#define MUX_LP_GPIO_10_SPI0_SCK                0x2
/* Mux values for LP_GPIO_11 */
#define MUX_LP_GPIO_11_SPI0_MOSI               0x2
#define MUX_LP_GPIO_11_GPIO                    0x0
#define MUX_LP_GPIO_11_MEGAMUX                 0x1
#define MUX_LP_GPIO_11_SPI_FLASH0_TXD          0x6
#define MUX_LP_GPIO_11_TEST_OUT_11             0x7
/* Mux values for LP_GPIO_12 */
#define MUX_LP_GPIO_12_SPI_FLASH0_SSN          0x6
#define MUX_LP_GPIO_12_GPIO                    0x0
#define MUX_LP_GPIO_12_SPI0_SSN                0x2
#define MUX_LP_GPIO_12_MEGAMUX                 0x1
#define MUX_LP_GPIO_12_TEST_OUT_12             0x7
/* Mux values for LP_GPIO_13 */
#define MUX_LP_GPIO_13_GPIO                    0x0
#define MUX_LP_GPIO_13_SPI_FLASH0_RXD          0x6
#define MUX_LP_GPIO_13_MEGAMUX                 0x1
#define MUX_LP_GPIO_13_SPI0_MISO               0x2
#define MUX_LP_GPIO_13_TEST_OUT_13             0x7

