memfault/zero-to-main/xdk-asf-3.32.0/sam0/utils/cmsis/samb11/include/pio/btlc1000wlcsp.h
/* MegaMux definitions                                              */
/* MegaMux values for LP_GPIO_0 */
#define MEGAMUX_LP_GPIO_0_I2C0_SCL                 0x9
#define MEGAMUX_LP_GPIO_0_UART1_CTS                0x6
#define MEGAMUX_LP_GPIO_0_COEX_BLE_MBSY            0x16
#define MEGAMUX_LP_GPIO_0_COEX_BLE_TX              0x13
#define MEGAMUX_LP_GPIO_0_UART0_RTS                0x3
#define MEGAMUX_LP_GPIO_0_UART0_RXD                0x0
#define MEGAMUX_LP_GPIO_0_32KHZ_CLK                0x10
#define MEGAMUX_LP_GPIO_0_COEX_BLE_IN_PROCESS      0x15
#define MEGAMUX_LP_GPIO_0_UART0_TXD                0x1
#define MEGAMUX_LP_GPIO_0_UART1_TXD                0x5
#define MEGAMUX_LP_GPIO_0_I2C1_SCL                 0xb
#define MEGAMUX_LP_GPIO_0_COEX_WLAN_RX             0x12
#define MEGAMUX_LP_GPIO_0_COEX_WLAN_TX             0x11
#define MEGAMUX_LP_GPIO_0_PWM1_OUT                 0xd
#define MEGAMUX_LP_GPIO_0_QUAD_DEC0_B              0x1e
#define MEGAMUX_LP_GPIO_0_UART1_RTS                0x7
#define MEGAMUX_LP_GPIO_0_UART0_CTS                0x2
#define MEGAMUX_LP_GPIO_0_UART1_RXD                0x4
#define MEGAMUX_LP_GPIO_0_COEX_BLE_PTI_0           0x19
#define MEGAMUX_LP_GPIO_0_COEX_BLE_PTI_1           0x1a
#define MEGAMUX_LP_GPIO_0_COEX_BLE_PTI_2           0x1b
#define MEGAMUX_LP_GPIO_0_COEX_BLE_PTI_3           0x1c
#define MEGAMUX_LP_GPIO_0_I2C1_SDA                 0xa
#define MEGAMUX_LP_GPIO_0_I2C0_SDA                 0x8
#define MEGAMUX_LP_GPIO_0_COEX_BLE_SYNC            0x17
#define MEGAMUX_LP_GPIO_0_QUAD_DEC2_A              0x21
#define MEGAMUX_LP_GPIO_0_QUAD_DEC2_B              0x22
#define MEGAMUX_LP_GPIO_0_COEX_BLE_RX              0x14
#define MEGAMUX_LP_GPIO_0_QUAD_DEC1_B              0x20
#define MEGAMUX_LP_GPIO_0_PWM3_OUT                 0xf
#define MEGAMUX_LP_GPIO_0_COEX_BLE_RXNTX           0x18
#define MEGAMUX_LP_GPIO_0_QUAD_DEC0_A              0x1d
#define MEGAMUX_LP_GPIO_0_PWM0_OUT                 0xc
#define MEGAMUX_LP_GPIO_0_QUAD_DEC1_A              0x1f
#define MEGAMUX_LP_GPIO_0_PWM2_OUT                 0xe
/* MegaMux values for LP_GPIO_1 */
#define MEGAMUX_LP_GPIO_1_I2C0_SCL                 0x9
#define MEGAMUX_LP_GPIO_1_UART1_CTS                0x6
#define MEGAMUX_LP_GPIO_1_COEX_BLE_MBSY            0x16
#define MEGAMUX_LP_GPIO_1_COEX_BLE_TX              0x13
#define MEGAMUX_LP_GPIO_1_UART0_RTS                0x3
#define MEGAMUX_LP_GPIO_1_UART0_RXD                0x0
#define MEGAMUX_LP_GPIO_1_32KHZ_CLK                0x10
#define MEGAMUX_LP_GPIO_1_COEX_BLE_IN_PROCESS      0x15
#define MEGAMUX_LP_GPIO_1_UART0_TXD                0x1
#define MEGAMUX_LP_GPIO_1_UART1_TXD                0x5
#define MEGAMUX_LP_GPIO_1_I2C1_SCL                 0xb
#define MEGAMUX_LP_GPIO_1_COEX_WLAN_RX             0x12
#define MEGAMUX_LP_GPIO_1_COEX_WLAN_TX             0x11
#define MEGAMUX_LP_GPIO_1_PWM1_OUT                 0xd
#define MEGAMUX_LP_GPIO_1_QUAD_DEC0_B              0x1e
#define MEGAMUX_LP_GPIO_1_UART1_RTS                0x7
#define MEGAMUX_LP_GPIO_1_UART0_CTS                0x2
#define MEGAMUX_LP_GPIO_1_UART1_RXD                0x4
#define MEGAMUX_LP_GPIO_1_COEX_BLE_PTI_0           0x19
#define MEGAMUX_LP_GPIO_1_COEX_BLE_PTI_1           0x1a
#define MEGAMUX_LP_GPIO_1_COEX_BLE_PTI_2           0x1b
#define MEGAMUX_LP_GPIO_1_COEX_BLE_PTI_3           0x1c
#define MEGAMUX_LP_GPIO_1_I2C1_SDA                 0xa
#define MEGAMUX_LP_GPIO_1_I2C0_SDA                 0x8
#define MEGAMUX_LP_GPIO_1_COEX_BLE_SYNC            0x17
#define MEGAMUX_LP_GPIO_1_QUAD_DEC2_A              0x21
#define MEGAMUX_LP_GPIO_1_QUAD_DEC2_B              0x22
#define MEGAMUX_LP_GPIO_1_COEX_BLE_RX              0x14
#define MEGAMUX_LP_GPIO_1_QUAD_DEC1_B              0x20
#define MEGAMUX_LP_GPIO_1_PWM3_OUT                 0xf
#define MEGAMUX_LP_GPIO_1_COEX_BLE_RXNTX           0x18
#define MEGAMUX_LP_GPIO_1_QUAD_DEC0_A              0x1d
#define MEGAMUX_LP_GPIO_1_PWM0_OUT                 0xc
#define MEGAMUX_LP_GPIO_1_QUAD_DEC1_A              0x1f
#define MEGAMUX_LP_GPIO_1_PWM2_OUT                 0xe
/* MegaMux values for LP_GPIO_2 */
#define MEGAMUX_LP_GPIO_2_I2C0_SCL                 0x9
#define MEGAMUX_LP_GPIO_2_UART1_CTS                0x6
#define MEGAMUX_LP_GPIO_2_COEX_BLE_MBSY            0x16
#define MEGAMUX_LP_GPIO_2_COEX_BLE_TX              0x13
#define MEGAMUX_LP_GPIO_2_UART0_RTS                0x3
#define MEGAMUX_LP_GPIO_2_UART0_RXD                0x0
#define MEGAMUX_LP_GPIO_2_32KHZ_CLK                0x10
#define MEGAMUX_LP_GPIO_2_COEX_BLE_IN_PROCESS      0x15
#define MEGAMUX_LP_GPIO_2_UART0_TXD                0x1
#define MEGAMUX_LP_GPIO_2_UART1_TXD                0x5
#define MEGAMUX_LP_GPIO_2_I2C1_SCL                 0xb
#define MEGAMUX_LP_GPIO_2_COEX_WLAN_RX             0x12
#define MEGAMUX_LP_GPIO_2_COEX_WLAN_TX             0x11
#define MEGAMUX_LP_GPIO_2_PWM1_OUT                 0xd
#define MEGAMUX_LP_GPIO_2_QUAD_DEC0_B              0x1e
#define MEGAMUX_LP_GPIO_2_UART1_RTS                0x7
#define MEGAMUX_LP_GPIO_2_UART0_CTS                0x2
#define MEGAMUX_LP_GPIO_2_UART1_RXD                0x4
#define MEGAMUX_LP_GPIO_2_COEX_BLE_PTI_0           0x19
#define MEGAMUX_LP_GPIO_2_COEX_BLE_PTI_1           0x1a
#define MEGAMUX_LP_GPIO_2_COEX_BLE_PTI_2           0x1b
#define MEGAMUX_LP_GPIO_2_COEX_BLE_PTI_3           0x1c
#define MEGAMUX_LP_GPIO_2_I2C1_SDA                 0xa
#define MEGAMUX_LP_GPIO_2_I2C0_SDA                 0x8
#define MEGAMUX_LP_GPIO_2_COEX_BLE_SYNC            0x17
#define MEGAMUX_LP_GPIO_2_QUAD_DEC2_A              0x21
#define MEGAMUX_LP_GPIO_2_QUAD_DEC2_B              0x22
#define MEGAMUX_LP_GPIO_2_COEX_BLE_RX              0x14
#define MEGAMUX_LP_GPIO_2_QUAD_DEC1_B              0x20
#define MEGAMUX_LP_GPIO_2_PWM3_OUT                 0xf
#define MEGAMUX_LP_GPIO_2_COEX_BLE_RXNTX           0x18
#define MEGAMUX_LP_GPIO_2_QUAD_DEC0_A              0x1d
#define MEGAMUX_LP_GPIO_2_PWM0_OUT                 0xc
#define MEGAMUX_LP_GPIO_2_QUAD_DEC1_A              0x1f
#define MEGAMUX_LP_GPIO_2_PWM2_OUT                 0xe
/* MegaMux values for LP_GPIO_3 */
#define MEGAMUX_LP_GPIO_3_I2C0_SCL                 0x9
#define MEGAMUX_LP_GPIO_3_UART1_CTS                0x6
#define MEGAMUX_LP_GPIO_3_COEX_BLE_MBSY            0x16
#define MEGAMUX_LP_GPIO_3_COEX_BLE_TX              0x13
#define MEGAMUX_LP_GPIO_3_UART0_RTS                0x3
#define MEGAMUX_LP_GPIO_3_UART0_RXD                0x0
#define MEGAMUX_LP_GPIO_3_32KHZ_CLK                0x10
#define MEGAMUX_LP_GPIO_3_COEX_BLE_IN_PROCESS      0x15
#define MEGAMUX_LP_GPIO_3_UART0_TXD                0x1
#define MEGAMUX_LP_GPIO_3_UART1_TXD                0x5
#define MEGAMUX_LP_GPIO_3_I2C1_SCL                 0xb
#define MEGAMUX_LP_GPIO_3_COEX_WLAN_RX             0x12
#define MEGAMUX_LP_GPIO_3_COEX_WLAN_TX             0x11
#define MEGAMUX_LP_GPIO_3_PWM1_OUT                 0xd
#define MEGAMUX_LP_GPIO_3_QUAD_DEC0_B              0x1e
#define MEGAMUX_LP_GPIO_3_UART1_RTS                0x7
#define MEGAMUX_LP_GPIO_3_UART0_CTS                0x2
#define MEGAMUX_LP_GPIO_3_UART1_RXD                0x4
#define MEGAMUX_LP_GPIO_3_COEX_BLE_PTI_0           0x19
#define MEGAMUX_LP_GPIO_3_COEX_BLE_PTI_1           0x1a
#define MEGAMUX_LP_GPIO_3_COEX_BLE_PTI_2           0x1b
#define MEGAMUX_LP_GPIO_3_COEX_BLE_PTI_3           0x1c
#define MEGAMUX_LP_GPIO_3_I2C1_SDA                 0xa
#define MEGAMUX_LP_GPIO_3_I2C0_SDA                 0x8
#define MEGAMUX_LP_GPIO_3_COEX_BLE_SYNC            0x17
#define MEGAMUX_LP_GPIO_3_QUAD_DEC2_A              0x21
#define MEGAMUX_LP_GPIO_3_QUAD_DEC2_B              0x22
#define MEGAMUX_LP_GPIO_3_COEX_BLE_RX              0x14
#define MEGAMUX_LP_GPIO_3_QUAD_DEC1_B              0x20
#define MEGAMUX_LP_GPIO_3_PWM3_OUT                 0xf
#define MEGAMUX_LP_GPIO_3_COEX_BLE_RXNTX           0x18
#define MEGAMUX_LP_GPIO_3_QUAD_DEC0_A              0x1d
#define MEGAMUX_LP_GPIO_3_PWM0_OUT                 0xc
#define MEGAMUX_LP_GPIO_3_QUAD_DEC1_A              0x1f
#define MEGAMUX_LP_GPIO_3_PWM2_OUT                 0xe
/* MegaMux values for LP_GPIO_8 */
#define MEGAMUX_LP_GPIO_8_I2C0_SCL                 0x9
#define MEGAMUX_LP_GPIO_8_UART1_CTS                0x6
#define MEGAMUX_LP_GPIO_8_COEX_BLE_MBSY            0x16
#define MEGAMUX_LP_GPIO_8_COEX_BLE_TX              0x13
#define MEGAMUX_LP_GPIO_8_UART0_RTS                0x3
#define MEGAMUX_LP_GPIO_8_UART0_RXD                0x0
#define MEGAMUX_LP_GPIO_8_32KHZ_CLK                0x10
#define MEGAMUX_LP_GPIO_8_COEX_BLE_IN_PROCESS      0x15
#define MEGAMUX_LP_GPIO_8_UART0_TXD                0x1
#define MEGAMUX_LP_GPIO_8_UART1_TXD                0x5
#define MEGAMUX_LP_GPIO_8_I2C1_SCL                 0xb
#define MEGAMUX_LP_GPIO_8_COEX_WLAN_RX             0x12
#define MEGAMUX_LP_GPIO_8_COEX_WLAN_TX             0x11
#define MEGAMUX_LP_GPIO_8_PWM1_OUT                 0xd
#define MEGAMUX_LP_GPIO_8_QUAD_DEC0_B              0x1e
#define MEGAMUX_LP_GPIO_8_UART1_RTS                0x7
#define MEGAMUX_LP_GPIO_8_UART0_CTS                0x2
#define MEGAMUX_LP_GPIO_8_UART1_RXD                0x4
#define MEGAMUX_LP_GPIO_8_COEX_BLE_PTI_0           0x19
#define MEGAMUX_LP_GPIO_8_COEX_BLE_PTI_1           0x1a
#define MEGAMUX_LP_GPIO_8_COEX_BLE_PTI_2           0x1b
#define MEGAMUX_LP_GPIO_8_COEX_BLE_PTI_3           0x1c
#define MEGAMUX_LP_GPIO_8_I2C1_SDA                 0xa
#define MEGAMUX_LP_GPIO_8_I2C0_SDA                 0x8
#define MEGAMUX_LP_GPIO_8_COEX_BLE_SYNC            0x17
#define MEGAMUX_LP_GPIO_8_QUAD_DEC2_A              0x21
#define MEGAMUX_LP_GPIO_8_QUAD_DEC2_B              0x22
#define MEGAMUX_LP_GPIO_8_COEX_BLE_RX              0x14
#define MEGAMUX_LP_GPIO_8_QUAD_DEC1_B              0x20
#define MEGAMUX_LP_GPIO_8_PWM3_OUT                 0xf
#define MEGAMUX_LP_GPIO_8_COEX_BLE_RXNTX           0x18
#define MEGAMUX_LP_GPIO_8_QUAD_DEC0_A              0x1d
#define MEGAMUX_LP_GPIO_8_PWM0_OUT                 0xc
#define MEGAMUX_LP_GPIO_8_QUAD_DEC1_A              0x1f
#define MEGAMUX_LP_GPIO_8_PWM2_OUT                 0xe
/* MegaMux values for LP_GPIO_9 */
#define MEGAMUX_LP_GPIO_9_I2C0_SCL                 0x9
#define MEGAMUX_LP_GPIO_9_UART1_CTS                0x6
#define MEGAMUX_LP_GPIO_9_COEX_BLE_MBSY            0x16
#define MEGAMUX_LP_GPIO_9_COEX_BLE_TX              0x13
#define MEGAMUX_LP_GPIO_9_UART0_RTS                0x3
#define MEGAMUX_LP_GPIO_9_UART0_RXD                0x0
#define MEGAMUX_LP_GPIO_9_32KHZ_CLK                0x10
#define MEGAMUX_LP_GPIO_9_COEX_BLE_IN_PROCESS      0x15
#define MEGAMUX_LP_GPIO_9_UART0_TXD                0x1
#define MEGAMUX_LP_GPIO_9_UART1_TXD                0x5
#define MEGAMUX_LP_GPIO_9_I2C1_SCL                 0xb
#define MEGAMUX_LP_GPIO_9_COEX_WLAN_RX             0x12
#define MEGAMUX_LP_GPIO_9_COEX_WLAN_TX             0x11
#define MEGAMUX_LP_GPIO_9_PWM1_OUT                 0xd
#define MEGAMUX_LP_GPIO_9_QUAD_DEC0_B              0x1e
#define MEGAMUX_LP_GPIO_9_UART1_RTS                0x7
#define MEGAMUX_LP_GPIO_9_UART0_CTS                0x2
#define MEGAMUX_LP_GPIO_9_UART1_RXD                0x4
#define MEGAMUX_LP_GPIO_9_COEX_BLE_PTI_0           0x19
#define MEGAMUX_LP_GPIO_9_COEX_BLE_PTI_1           0x1a
#define MEGAMUX_LP_GPIO_9_COEX_BLE_PTI_2           0x1b
#define MEGAMUX_LP_GPIO_9_COEX_BLE_PTI_3           0x1c
#define MEGAMUX_LP_GPIO_9_I2C1_SDA                 0xa
#define MEGAMUX_LP_GPIO_9_I2C0_SDA                 0x8
#define MEGAMUX_LP_GPIO_9_COEX_BLE_SYNC            0x17
#define MEGAMUX_LP_GPIO_9_QUAD_DEC2_A              0x21
#define MEGAMUX_LP_GPIO_9_QUAD_DEC2_B              0x22
#define MEGAMUX_LP_GPIO_9_COEX_BLE_RX              0x14
#define MEGAMUX_LP_GPIO_9_QUAD_DEC1_B              0x20
#define MEGAMUX_LP_GPIO_9_PWM3_OUT                 0xf
#define MEGAMUX_LP_GPIO_9_COEX_BLE_RXNTX           0x18
#define MEGAMUX_LP_GPIO_9_QUAD_DEC0_A              0x1d
#define MEGAMUX_LP_GPIO_9_PWM0_OUT                 0xc
#define MEGAMUX_LP_GPIO_9_QUAD_DEC1_A              0x1f
#define MEGAMUX_LP_GPIO_9_PWM2_OUT                 0xe
/* MegaMux values for LP_GPIO_10 */
#define MEGAMUX_LP_GPIO_10_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_10_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_10_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_10_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_10_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_10_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_10_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_10_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_10_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_10_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_10_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_10_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_10_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_10_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_10_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_10_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_10_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_10_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_10_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_10_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_10_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_10_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_10_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_10_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_10_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_10_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_10_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_10_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_10_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_10_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_10_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_10_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_10_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_10_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_10_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_11 */
#define MEGAMUX_LP_GPIO_11_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_11_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_11_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_11_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_11_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_11_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_11_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_11_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_11_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_11_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_11_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_11_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_11_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_11_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_11_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_11_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_11_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_11_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_11_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_11_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_11_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_11_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_11_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_11_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_11_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_11_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_11_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_11_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_11_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_11_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_11_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_11_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_11_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_11_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_11_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_12 */
#define MEGAMUX_LP_GPIO_12_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_12_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_12_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_12_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_12_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_12_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_12_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_12_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_12_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_12_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_12_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_12_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_12_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_12_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_12_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_12_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_12_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_12_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_12_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_12_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_12_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_12_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_12_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_12_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_12_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_12_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_12_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_12_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_12_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_12_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_12_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_13 */
#define MEGAMUX_LP_GPIO_13_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_13_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_13_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_13_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_13_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_13_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_13_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_13_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_13_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_13_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_13_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_13_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_13_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_13_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_13_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_13_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_13_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_13_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_13_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_13_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_13_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_13_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_13_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_13_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_13_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_13_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_13_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_13_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_13_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_13_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_13_PWM2_OUT                0xe

