memfault/zero-to-main/xdk-asf-3.32.0/sam0/utils/cmsis/samb11/include/pio/btlc1000wlcsp.h
#define PINMUX_LP_GPIO_13_M_UART0_CTS             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_UART0_CTS<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_UART1_RXD             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_UART1_RXD<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_I2C1_SDA              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_I2C1_SDA<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_I2C0_SDA              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_I2C0_SDA<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC2_A           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC2_A<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC2_B           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC2_B<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_RX           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_RX<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC1_B           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC1_B<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_PWM3_OUT              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_PWM3_OUT<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC0_A           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC0_A<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_PWM0_OUT              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_PWM0_OUT<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC1_A           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC1_A<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_PWM2_OUT              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_PWM2_OUT<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_SPI0_MISO               ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_SPI0_MISO )
#define PINMUX_LP_GPIO_13_TEST_OUT_13             ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_TEST_OUT_13 )

#endif /* _BTLC1000WLCSP_PIO_ */
